Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_cmt.c
/* lib/rx_hal/src/rx_cmt.c */

/**
 * @file rx_cmt.c
 * @brief CMT (Compare Match Timer) Driver Implementation - Periodic Interrupt Generation
 *
 * @details
 * # Overview
 *
 * Implements the CMT driver for periodic interrupt generation on the RX72N.
 * This file contains all internal helpers, interrupt handlers, and the public
 * API implementation for CMT channels 0-3.
 *
 * ## Implementation Architecture
 *
 * @dot
 * digraph implementation {
 *   rankdir=TB;
 *   node [shape=box, style=rounded];
 *
 *   subgraph cluster_public {
 *     label="Public API";
 *     style=filled;
 *     color=lightgreen;
 *     init [label="rx_cmt_init()"];
 *     start [label="rx_cmt_start()"];
 *     stop [label="rx_cmt_stop()"];
 *     count [label="rx_cmt_get_count()"];
 *     deinit [label="rx_cmt_deinit()"];
 *   }
 *
 *   subgraph cluster_internal {
 *     label="Internal Helpers";
 *     style=filled;
 *     color=lightyellow;
 *     get_base [label="internal_get_cmt_base()"];
 *     calc [label="internal_calculate_cmt_params()"];
 *     enable [label="internal_enable_cmt_module_clock()"];
 *     configure [label="internal_configure_cmt_timer_registers()"];
 *     irq [label="internal_configure_cmt_interrupt()"];
 *     validate [label="internal_validate_cmt_init_params()"];
 *     save [label="internal_save_cmt_callback()"];
 *   }
 *
 *   subgraph cluster_isr {
 *     label="Interrupt Handlers";
 *     style=filled;
 *     color=lightblue;
 *     cmt1_isr [label="cmt1_isr()"];
 *     cmt2_isr [label="cmt2_isr()"];
 *     cmt3_isr [label="cmt3_isr()"];
 *   }
 *
 *   init -> validate -> calc -> enable -> configure -> irq -> save;
 *   init -> start;
 *   start -> get_base;
 *   stop -> get_base;
 *   count -> get_base;
 *   cmt1_isr -> s_cmt_callback [label="call"];
 * }
 * @enddot
 *
 * ## CMT Timer Operation
 *
 * The CMT operates as a 16-bit up-counter with compare match:
 *
 * @msc
 * msc {
 *   width=600;
 *   CMCNT, CMCOR, ISR, Callback;
 *
 *   CMCNT box CMCNT [label="Counter at 0"];
 *   CMCNT -> CMCNT [label="Count: 1, 2, 3..."];
 *   CMCNT => CMCOR [label="CMCNT reaches CMCOR"];
 *   CMCOR box CMCOR [label="Compare match!\nCMCNT = 0"];
 *   CMCOR => ISR [label="CMIn interrupt"];
 *   ISR => Callback [label="s_cmt_callback[n]()"];
 *   Callback >> ISR;
 *   ISR >> CMCNT [label="Return"];
 *   CMCNT -> CMCNT [label="Continue counting..."];
 * }
 * @endmsc
 *
 * ## Clock Divider Selection Algorithm
 *
 * The driver tries each divider in order (/8, /32, /128, /512) and selects
 * the first one that produces a period fitting in 16 bits:
 *
 * ```
 * period = (PCLKB / divider) / frequency
 * if (0 < period <= 65535): use this divider
 * ```
 *
 * | Divider | PCLKB/div | Min Period | Max Period |
 * |---------|-----------|------------|------------|
 * | /8 | 7.5 MHz | 1 (7.5 MHz) | 65535 (115 Hz) |
 * | /32 | 1.875 MHz | 1 (1.875 MHz) | 65535 (29 Hz) |
 * | /128 | 468.75 kHz | 1 (469 kHz) | 65535 (7.2 Hz) |
 * | /512 | 117.2 kHz | 1 (117 kHz) | 65535 (1.8 Hz) |
 *
 * ## Memory Map (Static State)
 *
 * | Symbol | Size | Description |
 * |--------|------|-------------|
 * | s_cmt_initialized[] | 4 bytes | Per-channel init flags |
 * | s_cmt_callback[] | 16 bytes | Callback function pointers |
 * | s_cmt_user_data[] | 16 bytes | User data pointers |
 *
 * **Total static allocation:** 36 bytes
 *
 * ## Register Access Pattern
 *
 * All register access uses inline accessor functions for type safety:
 * - `cmt0()`, `cmt1()`, `cmt2()`, `cmt3()` - Channel registers
 * - `cmt_ctrl()` - Control registers (CMSTR0, CMSTR1)
 * - `icu()` - Interrupt controller
 *
 * ## NASA Power of 10 Compliance
 *
 * | Rule | Implementation |
 * |------|----------------|
 * | Rule 1 | No goto/recursion, single return paths |
 * | Rule 2 | Bounded loop in internal_calculate_cmt_params() |
 * | Rule 3 | Static arrays only, no heap |
 * | Rule 4 | All functions under 60 lines |
 * | Rule 5 | Parameter validation in all public functions |
 * | Rule 6 | File-scope static with s_ prefix |
 * | Rule 7 | All return values checked |
 * | Rule 8 | C23 typed enums for all constants |
 * | Rule 9 | Single-level pointers only |
 * | Rule 10 | Clean with -Wall -Wextra -Werror |
 *
 * @see rx_cmt.h Public API declarations
 * @see rx72n_cmt_regs.h CMT register definitions
 * @see rx_register_protection.h PRCR unlock for module stop
 *
 * @author STAR Team
 * @date 2026-01-27
 * @copyright Copyright (c) 2026 STAR Project
 * @since Version 1.0.0
 */

#include "rx_cmt.h"

#include <stddef.h>

#include "rx72n_regs.h"
#include "rx_check.h"
#include "rx_log.h"
#include "rx_register_protection.h"

/* Interrupt handler forward declarations (required for -Wmissing-declarations) */
void cmt1_isr(void);
void cmt2_isr(void);
void cmt3_isr(void);

static const char* s_tag = "CMT";

/* =============================================================================
 * Constants
 * =============================================================================
 */

/**
 * @enum cmt_constants_t
 * @brief CMT channel and divider configuration constants
 *
 * @details
 * Defines the channel count, divider settings, and loop bounds for CMT
 * configuration. These values correspond to RX72N hardware capabilities.
 *
 * ## Divider Settings (CMCR.CKS field)
 *
 * | CKS Value | Divider | Counter Clock @60MHz |
 * |-----------|---------|----------------------|
 * | 0b00 | /8 | 7.5 MHz |
 * | 0b01 | /32 | 1.875 MHz |
 * | 0b10 | /128 | 468.75 kHz |
 * | 0b11 | /512 | 117.19 kHz |
 *
 * @note k_cmt_divider_start and k_cmt_num_dividers define loop bounds
 *       for NASA Power of 10 Rule 2 compliance.
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_cmt_max_channels  = 4, /**< Total CMT channels: CMT0, CMT1, CMT2, CMT3 */
  k_cmt_divider_start = 0, /**< Loop start index for divider iteration (Rule 2) */
  k_cmt_div_8         = 0, /**< CKS=0b00: PCLKB/8 divider (7.5 MHz @ 60 MHz PCLKB) */
  k_cmt_div_32        = 1, /**< CKS=0b01: PCLKB/32 divider (1.875 MHz @ 60 MHz PCLKB) */
  k_cmt_div_128       = 2, /**< CKS=0b10: PCLKB/128 divider (468.75 kHz @ 60 MHz PCLKB) */
  k_cmt_div_512       = 3, /**< CKS=0b11: PCLKB/512 divider (117.19 kHz @ 60 MHz PCLKB) */
  k_cmt_num_dividers  = 4, /**< Loop bound for divider iteration (Rule 2 compliance) */
} cmt_constants_t;

/** @brief CMT divider values (actual divisor values) */
typedef enum : uint16_t {
  k_cmt_divider_val_8   = 8,   /**< Divide by 8 */
  k_cmt_divider_val_32  = 32,  /**< Divide by 32 */
  k_cmt_divider_val_128 = 128, /**< Divide by 128 */
  k_cmt_divider_val_512 = 512, /**< Divide by 512 */
} cmt_divider_values_t;

