Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_cmt.c
/** @brief CMT module stop bit positions in MSTPCRB */
typedef enum : uint8_t {
  k_cmt_mstpb_cmt = 15, /**< CMT0-CMT3 module stop bit */
} cmt_module_stop_bits_t;

/**
 * @struct rx_cmt_interrupt_config_t
 * @brief CMT interrupt routing and priority configuration
 *
 * @details
 * Bundles the CMT channel identifier with the desired ICU interrupt priority
 * level. Passed by value to internal_configure_cmt_interrupt() so that the
 * caller does not need to keep the structure alive after the call returns.
 *
 * The channel field selects which ICU interrupt vector to program (CMI0-CMI3),
 * and the priority field is written directly into the corresponding IPR[]
 * register.
 *
 * @invariant channel must be a valid rx_cmt_channel_t value (0-3)
 * @invariant priority must be in [k_ipr_level_min, k_ipr_level_max]
 *
 * @par Example:
 * @code{.c}
 * rx_cmt_interrupt_config_t irq_cfg = {
 *   .channel  = k_cmt_channel_1,
 *   .priority = 5,
 * };
 * rx_err_t err = internal_configure_cmt_interrupt(irq_cfg);
 * @endcode
 *
 * @see internal_configure_cmt_interrupt() Sole consumer of this struct
 * @see rx_cmt_init() Constructs this struct inline before calling the above
 *
 * @since Version 1.0.0
 */
typedef struct {
  rx_cmt_channel_t channel; /**< CMT channel identifier (k_cmt_channel_0 ... k_cmt_channel_3) */
  uint8_t priority; /**< ICU interrupt priority level (k_ipr_level_min ... k_ipr_level_max) */
} rx_cmt_interrupt_config_t;

/** @brief CMCR register bit positions */
typedef enum : uint8_t {
  k_cmt_cmcr_cks_shift = 0, /**< CKS (clock select) bit shift */
  k_cmt_cmcr_cmie_pos  = 6, /**< CMIE (interrupt enable) bit position */
} cmt_cmcr_bits_t;

/** @brief Period calculation constants */
typedef enum : uint16_t {
  k_cmt_period_min = 0,      /**< Minimum valid period */
  k_cmt_period_max = 0xFFFF, /**< Maximum valid period (16-bit) */
  k_cmt_period_adj = 1,      /**< Period adjustment (period - 1) */
} cmt_period_constants_t;

/** @brief CMSTR register bit positions */
typedef enum : uint8_t {
  k_cmt_cmstr_str0 = 0, /**< CMT0/CMT2 start bit */
  k_cmt_cmstr_str1 = 1, /**< CMT1/CMT3 start bit */
} cmt_cmstr_bits_t;

/** @brief CMT bit manipulation constants */
typedef enum : uint8_t {
  k_cmt_bit_mask_lsb = 1, /**< Single bit set for shifts */
  k_cmt_value_zero   = 0, /**< Zero value for comparisons */
} cmt_bit_constants_t;

/* =============================================================================
 * Static Variables
 * =============================================================================
 */

/**
 * @var s_cmt_initialized
 * @brief Per-channel initialization status flags
 *
 * @details
 * Tracks whether each CMT channel has been initialized. Set to true after
 * successful rx_cmt_init(), cleared on rx_cmt_deinit().
 *
 * | Index | Channel | Initial Value |
 * |-------|---------|---------------|
 * | 0 | CMT0 | false (ThreadX manages) |
 * | 1 | CMT1 | false |
 * | 2 | CMT2 | false |
 * | 3 | CMT3 | false |
 *
 * @note Used to prevent operations on uninitialized channels.
 * @warning Do not modify directly; managed by init/deinit functions.
 *
 * @since Version 1.0.0
 */
static bool s_cmt_initialized[k_cmt_max_channels] = {false};

/**
 * @var s_cmt_callback
 * @brief Per-channel interrupt callback function pointers
 *
 * @details
 * Stores user-provided callback functions for each CMT channel. Called from
 * the corresponding interrupt handler (cmt1_isr, cmt2_isr, cmt3_isr).
 *
 * @note NULL callbacks are valid - interrupt fires but no action taken.
 * @warning Callback executes in interrupt context. Keep it fast!
 *
 * @see rx_cmt_callback_t Callback function type
 *
 * @since Version 1.0.0
 */
static rx_cmt_callback_t s_cmt_callback[k_cmt_max_channels] = {nullptr};

/**
 * @var s_cmt_user_data
 * @brief Per-channel user data for callbacks
 *
 * @details
 * Stores user-provided context data passed to callbacks. Allows callbacks
 * to access application-specific state without global variables.
 *
 * @note May be NULL if callback doesn't need user data.
 *
 * @since Version 1.0.0
 */
static void* s_cmt_user_data[k_cmt_max_channels] = {nullptr};

/* =============================================================================
 * Internal Helper Functions
 * =============================================================================
 */

/**
 * @brief Map a CMT channel enum to its hardware register base pointer
 *
 * @details
 * Uses a switch statement to convert a logical channel identifier into a
 * pointer to the corresponding volatile rx_cmt_channel_regs_t register block.
 * The four CMT channels (CMT0-CMT3) each have a distinct base address in the
 * RX72N memory map; the inline accessor functions cmt0()-cmt3() encode those
 * addresses in a type-safe manner.
 *
 * The default case returns nullptr, which every caller is expected to check
 * immediately after the call (NASA Rule 7 compliance).
 *
 * @param[in] channel CMT channel to resolve
 *   - **Valid range**: k_cmt_channel_0 through k_cmt_channel_3
 *   - Any other value results in a nullptr return
 *
 * @return Pointer to the volatile CMT channel register block
 * @retval Non-null Pointer to rx_cmt_channel_regs_t for the requested channel
 * @retval nullptr   channel is outside the valid range [0, 3]
 *
 * @pre channel is a member of rx_cmt_channel_t (0-3)
 * @pre Hardware register addresses must be accessible (clocks enabled before use)
 *
 * @post Return value, if non-null, points to the live hardware register block
 * @post Caller must validate the return value before dereferencing (Rule 7)
 *
 * @note Not thread-safe; the hardware registers are globally shared
 * @note This function never writes to hardware; it only computes an address
 *
 * @par Thread Safety:
 * Read-only address computation; no shared mutable state is accessed.
 *
 * @par Performance:
 * Execution time: ~1 cycle (single branch/address load with -O2)
 *
 * @par Example:
 * @code{.c}
 * volatile rx_cmt_channel_regs_t* cmt = internal_get_cmt_base(k_cmt_channel_2);
 * if (cmt == nullptr) {
 *   return k_rx_err_invalid_arg;
 * }
 * cmt->cmcnt = 0;
 * @endcode
 *
 * @see cmt0() Inline accessor for CMT0 base address
 * @see cmt1() Inline accessor for CMT1 base address
 * @see cmt2() Inline accessor for CMT2 base address
 * @see cmt3() Inline accessor for CMT3 base address
 *
 * @since Version 1.0.0
 */
static volatile rx_cmt_channel_regs_t* internal_get_cmt_base(const rx_cmt_channel_t channel)
{
  switch (channel) {
    case k_cmt_channel_0:
      return cmt0();
    case k_cmt_channel_1:
      return cmt1();
    case k_cmt_channel_2:
      return cmt2();
    case k_cmt_channel_3:
      return cmt3();
    default:
      return nullptr;
  }
}

/**
 * @brief Calculate the optimal CMT clock divider and compare-match value for a target frequency
 *
 * @details
 * Iterates the four available PCLKB clock dividers (/8, /32, /128, /512) in
 * ascending order and selects the first divider whose resulting 16-bit period
 * value satisfies:
 *
 * ```
 * period = (PCLKB / divider) / frequency_hz
 * 0 < period <= 65535
 * ```
 *
 * The chosen divider index is returned in *divider (corresponding to the CKS
 * field of CMCR: 0=/8, 1=/32, 2=/128, 3=/512).  The compare-match register
 * value is returned in *cmcor; the caller must subtract the adjustment constant
 * k_cmt_period_adj when writing to the hardware register.
 *
 * Algorithm steps:
 * 1. Validate output pointers are non-null
 * 2. Reject frequency_hz == 0 or frequency_hz > PCLKB/8 (maximum achievable)
 * 3. Loop i from k_cmt_divider_start to k_cmt_num_dividers - 1
 * 4.   Compute period_calc = (PCLKB / dividers[i]) / frequency_hz
 * 5.   If 0 < period_calc <= 65535, store i and period_calc, return k_rx_ok
 * 6. If no divider fits, return k_rx_err_invalid_arg
 *
 * @param[in]  frequency_hz Target interrupt frequency in Hz
 *   - **Valid range**: 1 to PCLKB/8 (typically 1 to 7,500,000 Hz)
 *   - **Constraint**: Must produce a period that fits in 16 bits for at least
 *     one of the four clock dividers
 * @param[out] divider CKS field value to write into CMCR.CKS (0-3)
 *   - **On success**: Set to the index of the chosen divider
 *   - **On failure**: Undefined
 * @param[out] cmcor  Raw period count before the -1 adjustment
 *   - **On success**: Set to (PCLKB / divider_value) / frequency_hz
 *   - **On failure**: Undefined
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok           Divider and compare-match value computed successfully
 * @retval k_rx_err_null_ptr divider or cmcor is nullptr
 * @retval k_rx_err_invalid_arg frequency_hz is 0, exceeds PCLKB/8, or no
 *                               divider produces a period fitting in 16 bits
 *
 * @pre divider must point to a valid uint8_t storage location
 * @pre cmcor must point to a valid uint16_t storage location
 *
 * @post On k_rx_ok: *divider holds the CKS value (0-3) for CMCR
 * @post On k_rx_ok: *cmcor holds the period count; caller subtracts 1 before writing CMCOR
 *
 * @note Not thread-safe; pure computation with no shared state modification
 * @note Uses a bounded loop (k_cmt_num_dividers iterations) -- NASA Rule 2 compliant
 *
 * @par Thread Safety:
 * Pure computation with no global or static state; safe to call from any context.
 *
 * @par Performance:
 * Execution time: ~5 cycles (loop unrolled at -O2 for 4 divider steps)
 *
 * @par Example:
 * @code{.c}
 * uint8_t  divider = 0;
 * uint16_t cmcor   = 0;
 * rx_err_t err = internal_calculate_cmt_params(1000U, &divider, &cmcor);
 * if (err == k_rx_ok) {
 *   // divider and cmcor are ready for use in CMCR/CMCOR registers
 * }
 * @endcode
 *
 * @see internal_configure_cmt_timer_registers() Consumes the output of this function
 * @see cmt_constants_t  Divider index constants (k_cmt_div_8 ... k_cmt_div_512)
 * @see cmt_divider_values_t Actual divisor values (8, 32, 128, 512)
 *
 * @since Version 1.0.0
 */
static rx_err_t
internal_calculate_cmt_params(const uint32_t frequency_hz, uint8_t* divider, uint16_t* cmcor)
{
  static const uint16_t dividers[]    = {k_cmt_divider_val_8,
                                         k_cmt_divider_val_32,
                                         k_cmt_divider_val_128,
                                         k_cmt_divider_val_512};
  const uint32_t        pclkb         = k_pclkb_hz;
  const uint32_t        max_frequency = pclkb / k_cmt_divider_val_8;

  if (divider == nullptr || cmcor == nullptr) {
    return k_rx_err_null_ptr;
  }

