Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_cmt.c
  if (frequency_hz <= (uint32_t)k_cmt_value_zero || frequency_hz > max_frequency) {
    return k_rx_err_invalid_arg;
  }

  /* Try each divider to find one that fits in 16-bit */
  for (uint8_t i = k_cmt_divider_start; i < k_cmt_num_dividers; i++) {
    const uint32_t period_calc = (pclkb / dividers[i]) / frequency_hz;

    /* Check if period fits in 16-bit and is reasonable */
    if (period_calc > k_cmt_period_min && period_calc <= k_cmt_period_max) {
      *divider = i;
      *cmcor   = (uint16_t)period_calc;
      return k_rx_ok;
    }
  }

  rx_log_error(s_tag, "Error occurred");
  return k_rx_err_invalid_arg;
}

/**
 * @brief Enable the CMT module clock by clearing the MSTPCRB module-stop bit
 *
 * @details
 * Removes the CMT0-CMT3 peripheral from module-stop state so that the module
 * clock is supplied and its registers become accessible. The sequence is:
 *
 * 1. Unlock the write-protect register (PRCR) for PRC1 and PRC3 bits
 * 2. Clear bit k_cmt_mstpb_cmt (bit 15) in the MSTPCRB register
 * 3. Re-lock the PRCR to prevent accidental modification
 *
 * This function must be called before any CMT register access; reading or
 * writing CMT registers while the module clock is stopped produces undefined
 * hardware behaviour on the RX72N.
 *
 * The function is idempotent: calling it when the module is already enabled
 * simply clears an already-clear bit, which is harmless.
 *
 * @return void This function does not return an error code. Hardware register
 *              access failures are not detectable at this level; the caller
 *              relies on subsequent register reads for verification.
 *
 * @pre The system clock (PCLKB) must be running before calling this function
 * @pre No other task or ISR must be concurrently modifying MSTPCRB
 *
 * @post MSTPCRB bit 15 is cleared; CMT module clock is active
 * @post PRCR is locked upon return (prevents accidental MSTPCRB changes)
 *
 * @note Not thread-safe; PRCR unlock/lock is a non-atomic read-modify-write
 * @note Called once per system lifetime; subsequent calls are benign
 *
 * @par Thread Safety:
 * Not thread-safe. Call during system initialization before RTOS scheduler
 * starts, or with interrupts disabled.
 *
 * @par Performance:
 * Execution time: ~4 register writes; negligible overhead
 *
 * @par Example:
 * @code{.c}
 * // Called internally by rx_cmt_init(); not intended for direct use
 * internal_enable_cmt_module_clock();
 * // CMT registers are now accessible
 * @endcode
 *
 * @see rx_register_protection.h  PRCR lock/unlock constants
 * @see rx_cmt_init()             Sole caller; invoked before register programming
 *
 * @since Version 1.0.0
 */
static void internal_enable_cmt_module_clock(void)
{
  *prcr_reg() = k_rx_prcr_unlock_prc1_prc3;
  system_regs()->mstpcrb &= ~((uint32_t)k_cmt_bit_mask_lsb << k_cmt_mstpb_cmt);
  *prcr_reg() = k_rx_prcr_lock;
}

/**
 * @brief Write clock divider, interrupt-enable, compare-match, and counter registers
 *
 * @details
 * Programs the three CMT hardware registers for a single channel in the
 * following order:
 *
 * 1. **CMCR** - Sets the CKS (clock-select) field from divider and enables the
 *    compare-match interrupt (CMIE bit).
 * 2. **CMCOR** - Loads the compare-match value after subtracting the adjustment
 *    constant k_cmt_period_adj (-1) so the hardware fires at the correct period.
 * 3. **CMCNT** - Clears the counter to 0 so the first interrupt occurs exactly
 *    one full period after the timer is started.
 *
 * The timer must be stopped (CMSTR bit cleared) before calling this function
 * to avoid race conditions while writing to CMCOR and CMCNT.
 *
 * @param[in] cmt     Pointer to the volatile CMT channel register block
 *   - **Constraint**: Must not be nullptr (asserted)
 * @param[in] divider CKS clock-select field value (0-3) produced by
 *                    internal_calculate_cmt_params()
 *   - 0 = PCLKB/8, 1 = PCLKB/32, 2 = PCLKB/128, 3 = PCLKB/512
 * @param[in] cmcor   Period count (before adjustment) produced by
 *                    internal_calculate_cmt_params(); the -1 adjustment is
 *                    applied internally before writing to hardware
 *
 * @return void This function does not return an error code; the assert on cmt
 *              is the only validation gate.
 *
 * @pre cmt must not be nullptr (enforced by RX_ASSERT)
 * @pre The CMT timer must be stopped before calling this function
 *
 * @post cmt->cmcr  = (divider << CKS_SHIFT) | CMIE_BIT
 * @post cmt->cmcor = cmcor - k_cmt_period_adj
 * @post cmt->cmcnt = 0
 *
 * @note Not thread-safe; caller must ensure the timer is stopped
 * @note RX_ASSERT fires in debug builds if cmt is nullptr
 *
 * @par Thread Safety:
 * Not thread-safe. Must be called with the timer stopped and no concurrent ISR
 * activity on this channel.
 *
 * @par Performance:
 * Execution time: ~3 register writes; negligible overhead
 *
 * @par Example:
 * @code{.c}
 * uint8_t  divider = 0;
 * uint16_t cmcor   = 0;
 * (void)internal_calculate_cmt_params(1000U, &divider, &cmcor);
 * volatile rx_cmt_channel_regs_t* cmt = internal_get_cmt_base(k_cmt_channel_1);
 * internal_configure_cmt_timer_registers(cmt, divider, cmcor);
 * @endcode
 *
 * @see internal_calculate_cmt_params() Produces the divider and cmcor arguments
 * @see rx_cmt_stop()                   Must be called before this function
 * @see cmt_cmcr_bits_t                 CKS shift and CMIE bit position constants
 *
 * @since Version 1.0.0
 */
static void internal_configure_cmt_timer_registers(volatile rx_cmt_channel_regs_t* cmt,
                                                   const uint8_t                   divider,
                                                   const uint16_t                  cmcor)
{
  RX_ASSERT(cmt != nullptr, "CMT registers are NULL");

  /* Configure timer control register
   * - Set clock divider
   * - Enable compare match interrupt
   */
  cmt->cmcr =
    (divider << k_cmt_cmcr_cks_shift) |          /* CKS: Clock Select */
    (k_cmt_bit_mask_lsb << k_cmt_cmcr_cmie_pos); /* CMIE: Compare Match Interrupt Enable */

  /* Set compare match value (period - 1) */
  cmt->cmcor = cmcor - k_cmt_period_adj;

  /* Clear counter */
  cmt->cmcnt = k_cmt_value_zero;
}

/**
 * @brief Configure the ICU interrupt vector priority and enable for a CMT channel
 *
 * @details
 * Programs the Interrupt Controller Unit (ICU) to route and enable the
 * compare-match interrupt (CMIn) for the specified CMT channel. The three
 * ICU registers modified are:
 *
 * 1. **IPR[vector]** - Sets the interrupt priority level for the channel's
 *    CMIn vector to config.priority.
 * 2. **IER[index]** - Sets the enable bit for the channel's interrupt vector
 *    within the IER register array. The bit index and byte index are derived
 *    from the vector number.
 * 3. **IR[vector]** - Clears any pending interrupt flag before enabling, so
 *    a stale flag does not fire immediately after enable.
 *
 * The vector number is computed as k_vect_cmt0_cmi0 + config.channel, which
 * yields CMI0 for channel 0, CMI1 for channel 1, and so on.
 *
 * @param[in] config Interrupt routing and priority specification (passed by value)
 *   - **config.channel**: CMT channel (0-3); mapped to ICU vector
 *   - **config.priority**: ICU priority (k_ipr_level_min to k_ipr_level_max)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok             ICU programmed successfully
 * @retval k_rx_err_invalid_arg config.channel >= k_cmt_max_channels, or
 *                               config.priority outside [k_ipr_level_min, k_ipr_level_max]
 *
 * @pre config.channel must be in the range [0, k_cmt_max_channels)
 * @pre config.priority must be in [k_ipr_level_min, k_ipr_level_max]
 *
 * @post ICU IPR register for the channel's vector set to config.priority
 * @post ICU IER bit for the channel's vector enabled
 * @post ICU IR flag for the channel's vector cleared
 *
 * @note Not thread-safe; concurrent ICU modification from another context is unsafe
 * @note Clears IR before enabling to prevent a spurious first interrupt
 *
 * @par Thread Safety:
 * Not thread-safe. Must be called during initialization with interrupts disabled
 * or before the RTOS scheduler starts.
 *
 * @par Performance:
 * Execution time: ~4 register accesses; negligible overhead
 *
 * @par Example:
 * @code{.c}
 * rx_cmt_interrupt_config_t irq_cfg = {
 *   .channel  = k_cmt_channel_1,
 *   .priority = 5,
 * };
 * rx_err_t err = internal_configure_cmt_interrupt(irq_cfg);
 * if (err != k_rx_ok) {
 *   return err;
 * }
 * @endcode
 *
 * @see rx_cmt_interrupt_config_t  Configuration structure passed to this function
 * @see rx_cmt_deinit()            Clears the IER bit to disable the interrupt
 * @see rx_cmt_init()              Constructs config and calls this function
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_configure_cmt_interrupt(const rx_cmt_interrupt_config_t config)
{
  /* Note: Lower bound check omitted - config.channel is uint8_t, k_cmt_channel_0 == 0,
   * so config.channel >= k_cmt_channel_0 is always true (-Wtype-limits) */
  if ((uint8_t)config.channel >= (uint8_t)k_cmt_max_channels) {
    return k_rx_err_invalid_arg;
  }
  if (config.priority < k_ipr_level_min || config.priority > k_ipr_level_max) {
    return k_rx_err_invalid_arg;
  }

  const uint8_t vector    = k_vect_cmt0_cmi0 + config.channel;
  const uint8_t ier_index = vector / k_icu_ier_bits_per_reg;
  const uint8_t ier_bit   = vector % k_icu_ier_bits_per_reg;

  icu()->ipr[vector]     = config.priority;
  const uint8_t ier_mask = (uint8_t)(k_cmt_bit_mask_lsb << ier_bit);
  icu()->ier[ier_index] |= ier_mask;
  icu()->ir[vector] = k_cmt_value_zero;

