Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_cmt.c
  return k_rx_ok;
}

/* =============================================================================
 * Interrupt Handlers
 * =============================================================================
 */

/**
 * @brief CMT1 (CMT channel 1) compare-match interrupt service routine
 *
 * @details
 * Invoked by the RX72N hardware whenever the CMT1 counter (CMCNT) reaches the
 * value stored in CMCOR. The ISR checks whether a callback has been registered
 * in s_cmt_callback[k_cmt_channel_1] and, if so, calls it with the associated
 * user data pointer from s_cmt_user_data[k_cmt_channel_1].
 *
 * The compare-match interrupt flag is automatically cleared by the RX72N
 * hardware upon entry; no explicit IR register write is needed.
 *
 * @note Executes in interrupt context; all code in this ISR and any registered
 *       callback must be ISR-safe (no blocking, no long operations)
 * @note Not thread-safe; the callback executes with the CMT1 interrupt masked
 *
 * @warning Do not call any ThreadX API that is not interrupt-safe from the
 *          registered callback (e.g., tx_thread_sleep() is forbidden; use
 *          ISR-safe variants such as tx_semaphore_put_from_isr())
 *
 * @see rx_cmt_init()       Registers the callback invoked by this ISR
 * @see rx_cmt_deinit()     Clears the callback and disables this interrupt
 * @see s_cmt_callback      Per-channel callback function pointer array
 *
 * @since Version 1.0.0
 */
void cmt1_isr(void)
{
  /* Call user callback if registered */
  if (s_cmt_callback[k_cmt_channel_1] != nullptr) {
    s_cmt_callback[k_cmt_channel_1](s_cmt_user_data[k_cmt_channel_1]);
  }

  /* Clear interrupt flag (read-modify-write not needed, auto-cleared) */
}

/**
 * @brief CMT2 (CMT channel 2) compare-match interrupt service routine
 *
 * @details
 * Invoked by the RX72N hardware whenever the CMT2 counter (CMCNT) reaches the
 * value stored in CMCOR. The ISR checks whether a callback has been registered
 * in s_cmt_callback[k_cmt_channel_2] and, if so, calls it with the associated
 * user data pointer from s_cmt_user_data[k_cmt_channel_2].
 *
 * The compare-match interrupt flag is automatically cleared by the RX72N
 * hardware upon entry; no explicit IR register write is needed.
 *
 * @note Executes in interrupt context; all code in this ISR and any registered
 *       callback must be ISR-safe (no blocking, no long operations)
 * @note Not thread-safe; the callback executes with the CMT2 interrupt masked
 *
 * @warning Do not call any ThreadX API that is not interrupt-safe from the
 *          registered callback (e.g., tx_thread_sleep() is forbidden; use
 *          ISR-safe variants such as tx_semaphore_put_from_isr())
 *
 * @see rx_cmt_init()       Registers the callback invoked by this ISR
 * @see rx_cmt_deinit()     Clears the callback and disables this interrupt
 * @see s_cmt_callback      Per-channel callback function pointer array
 *
 * @since Version 1.0.0
 */
void cmt2_isr(void)
{
  if (s_cmt_callback[k_cmt_channel_2] != nullptr) {
    s_cmt_callback[k_cmt_channel_2](s_cmt_user_data[k_cmt_channel_2]);
  }
}

/**
 * @brief CMT3 (CMT channel 3) compare-match interrupt service routine
 *
 * @details
 * Invoked by the RX72N hardware whenever the CMT3 counter (CMCNT) reaches the
 * value stored in CMCOR. The ISR checks whether a callback has been registered
 * in s_cmt_callback[k_cmt_channel_3] and, if so, calls it with the associated
 * user data pointer from s_cmt_user_data[k_cmt_channel_3].
 *
 * The compare-match interrupt flag is automatically cleared by the RX72N
 * hardware upon entry; no explicit IR register write is needed.
 *
 * @note Executes in interrupt context; all code in this ISR and any registered
 *       callback must be ISR-safe (no blocking, no long operations)
 * @note Not thread-safe; the callback executes with the CMT3 interrupt masked
 *
 * @warning Do not call any ThreadX API that is not interrupt-safe from the
 *          registered callback (e.g., tx_thread_sleep() is forbidden; use
 *          ISR-safe variants such as tx_semaphore_put_from_isr())
 *
 * @see rx_cmt_init()       Registers the callback invoked by this ISR
 * @see rx_cmt_deinit()     Clears the callback and disables this interrupt
 * @see s_cmt_callback      Per-channel callback function pointer array
 *
 * @since Version 1.0.0
 */
void cmt3_isr(void)
{
  if (s_cmt_callback[k_cmt_channel_3] != nullptr) {
    s_cmt_callback[k_cmt_channel_3](s_cmt_user_data[k_cmt_channel_3]);
  }
}

/* =============================================================================
 * Additional Internal Helpers for rx_cmt_init
 * =============================================================================
 */

/**
 * @brief Validate channel and configuration pointer before CMT initialisation
 *
 * @details
 * Performs all parameter checking required before rx_cmt_init() proceeds to
 * hardware configuration. Validation is performed in this strict order:
 *
 * 1. Verify config pointer is non-null (k_rx_err_null_ptr)
 * 2. Verify channel is within [0, k_cmt_max_channels) (k_rx_err_invalid_arg)
 * 3. Reject channel 0, which is reserved for the ThreadX system-tick timer
 *    (k_rx_err_conflict)
 * 4. Verify interrupt priority is within [k_ipr_level_min, k_ipr_level_max]
 *    (k_rx_err_invalid_arg)
 *
 * Centralising these checks in a dedicated helper keeps the main rx_cmt_init()
 * function concise and ensures that every check is logged before returning.
 *
 * @param[in] channel CMT channel to validate
 *   - **Valid range**: k_cmt_channel_1 through k_cmt_channel_3
 *   - k_cmt_channel_0 is rejected (reserved for ThreadX)
 * @param[in] config Pointer to the channel configuration structure
 *   - **Null handling**: Returns k_rx_err_null_ptr immediately if nullptr
 *   - **priority field**: Must be in [k_ipr_level_min, k_ipr_level_max]
 *
 * @return rx_err_t Error code indicating success or the first validation failure
 * @retval k_rx_ok             All parameters are valid
 * @retval k_rx_err_null_ptr   config is nullptr
 * @retval k_rx_err_invalid_arg channel >= k_cmt_max_channels, or
 *                               config->priority out of [min, max]
 * @retval k_rx_err_conflict   channel == k_cmt_channel_0 (ThreadX reserved)
 *
 * @pre config must be a pointer to a caller-owned rx_cmt_config_t (may be nullptr)
 * @pre channel must be a member of rx_cmt_channel_t
 *
 * @post On k_rx_ok: channel and *config are safe to use for hardware programming
 * @post On error: an error message has been emitted via rx_log_error()
 *
 * @note Not thread-safe; pure validation with no shared state modification
 * @note The lower-bound check `channel >= k_cmt_channel_0` is intentionally
 *       omitted to avoid -Wtype-limits: channel is uint8_t and k_cmt_channel_0 == 0,
 *       making the comparison always true
 *
 * @par Thread Safety:
 * Pure validation; no shared mutable state is modified. Safe to call from any
 * context, but the result may be stale if state changes after the call.
 *
 * @par Performance:
 * Execution time: ~4 comparisons; negligible overhead
 *
 * @par Example:
 * @code{.c}
 * rx_err_t err = internal_validate_cmt_init_params(k_cmt_channel_1, &config);
 * if (err != k_rx_ok) {
 *   return err;
 * }
 * @endcode
 *
 * @see rx_cmt_init()     Sole caller; uses this to guard hardware programming
 * @see rx_cmt_config_t   Configuration structure whose fields are validated here
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_validate_cmt_init_params(const rx_cmt_channel_t channel,
                                                  const rx_cmt_config_t* config)
{
  if (config == nullptr) {
    rx_log_error(s_tag, "config pointer is nullptr");
    return k_rx_err_null_ptr;
  }

  /* Note: Lower bound check omitted - channel is uint8_t, k_cmt_channel_0 == 0,
   * so channel >= k_cmt_channel_0 is always true (-Wtype-limits) */
  if ((uint8_t)channel >= (uint8_t)k_cmt_max_channels) {
    rx_log_error(s_tag, "Invalid CMT channel");
    return k_rx_err_invalid_arg;
  }

