Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_cmt.c
  /* CMT0 is reserved for ThreadX system tick */
  if (channel == k_cmt_channel_0) {
    rx_log_error(s_tag, "CMT0 is reserved for ThreadX");
    return k_rx_err_conflict;
  }

  if (config->priority < k_ipr_level_min || config->priority > k_ipr_level_max) {
    rx_log_error(s_tag, "Invalid interrupt priority");
    return k_rx_err_invalid_arg;
  }

  return k_rx_ok;
}

/**
 * @brief Persist the user callback, user-data pointer, and channel initialized flag
 *
 * @details
 * Copies the callback function pointer and user-data pointer from the caller's
 * configuration structure into the module-level static arrays, then marks the
 * channel as initialized. After this call the ISR for the channel will invoke
 * the registered callback on every compare-match event.
 *
 * This function is the final step in the rx_cmt_init() sequence. It must only
 * be called after all hardware registers have been programmed and the interrupt
 * has been configured in the ICU, so that the ISR never encounters a partially
 * initialised channel state.
 *
 * @param[in] channel CMT channel whose callback state is to be saved
 *   - **Valid range**: k_cmt_channel_1 through k_cmt_channel_3
 *   - Caller (rx_cmt_init) has already validated the channel
 * @param[in] config Pointer to the CMT configuration structure
 *   - **config->callback**: Function pointer (may be nullptr; ISR is a no-op if null)
 *   - **config->user_data**: Opaque pointer passed verbatim to callback (may be nullptr)
 *   - **Null handling**: Caller guarantees config is non-null
 *
 * @return void This function does not return an error code; all preconditions
 *              are enforced by the caller before this function is invoked.
 *
 * @pre channel must be valid and in range [1, k_cmt_max_channels) (validated by caller)
 * @pre config must be non-null (validated by internal_validate_cmt_init_params)
 *
 * @post s_cmt_callback[channel]    = config->callback
 * @post s_cmt_user_data[channel]   = config->user_data
 * @post s_cmt_initialized[channel] = true
 *
 * @note Not thread-safe; must be the last step of rx_cmt_init() with interrupts
 *       either disabled or not yet fired for this channel
 * @note After this call the channel is considered "live"; the ISR may fire at
 *       any point
 *
 * @par Thread Safety:
 * Not thread-safe. The three static array writes are not atomic. Call only
 * during initialization with the channel interrupt not yet active.
 *
 * @par Performance:
 * Execution time: ~3 stores; negligible overhead
 *
 * @par Example:
 * @code{.c}
 * // Final step inside rx_cmt_init() after all hardware setup is complete
 * internal_save_cmt_callback(channel, config);
 * // s_cmt_initialized[channel] is now true; ISR will call config->callback
 * @endcode
 *
 * @see rx_cmt_init()      Sole caller; calls this as the last initialisation step
 * @see rx_cmt_deinit()    Clears the state written by this function
 * @see s_cmt_callback     Destination array for config->callback
 * @see s_cmt_user_data    Destination array for config->user_data
 * @see s_cmt_initialized  Destination array for the initialized flag
 *
 * @since Version 1.0.0
 */
static void internal_save_cmt_callback(const rx_cmt_channel_t channel,
                                       const rx_cmt_config_t* config)
{
  s_cmt_callback[channel]    = config->callback;
  s_cmt_user_data[channel]   = config->user_data;
  s_cmt_initialized[channel] = true;
}

/* =============================================================================
 * Public API Implementation
 * =============================================================================
 */

/**
 * @brief Initialize a CMT channel for periodic interrupt generation
 *
 * @details
 * Configures a CMT (Compare Match Timer) channel to fire a user callback at the
 * requested frequency. Validates parameters, selects the optimal clock divider,
 * enables the module clock, stops the timer for safe configuration, programs
 * timer registers, configures the ICU interrupt routing, saves the callback,
 * and starts the timer.
 *
 * **Algorithm steps:**
 * 1. Validate channel and config parameters via internal_validate_cmt_init_params()
 * 2. Obtain CMT channel register base via internal_get_cmt_base()
 * 3. Calculate optimal divider and CMCOR value via internal_calculate_cmt_params()
 * 4. Enable CMT module clock (clear MSTPCRB bit) via internal_enable_cmt_module_clock()
 * 5. Stop the timer to allow safe register writes via rx_cmt_stop()
 * 6. Program CMCR (divider + CMIE) and CMCOR via internal_configure_cmt_timer_registers()
 * 7. Configure ICU interrupt vector priority and enable via internal_configure_cmt_interrupt()
 * 8. Save callback pointer and mark channel initialized via internal_save_cmt_callback()
 * 9. Start the timer via rx_cmt_start()
 *
 * **Clock divider selection:**
 * The driver iterates dividers /8, /32, /128, /512 and picks the first that
 * produces a period fitting in 16 bits:
 * @code
 * period = (PCLKB / divider) / frequency_hz
 * if (0 < period <= 65535): use this divider
 * @endcode
 *
 * @param[in] channel CMT channel to initialize
 *   - **Valid range**: k_cmt_channel_1, k_cmt_channel_2, k_cmt_channel_3
 *   - **Reserved**: k_cmt_channel_0 is reserved for ThreadX system tick
 *
 * @param[in] config Pointer to channel configuration structure
 *   - **frequency_hz**: Desired interrupt frequency in Hz (> 0, <= PCLKB/8)
 *   - **priority**: ICU interrupt priority (k_ipr_level_min to k_ipr_level_max)
 *   - **callback**: Function called from interrupt context on each match
 *   - **user_data**: Opaque pointer passed to callback (may be nullptr)
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success; timer running and callback registered
 * @retval k_rx_err_null_ptr config is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel, frequency out of range, or invalid priority
 * @retval k_rx_err_conflict channel is k_cmt_channel_0 (reserved for ThreadX)
 * @retval k_rx_err_hw_error Timer start verification failed (CMSTR readback mismatch)
 *
 * @pre config must point to a valid rx_cmt_config_t structure
 * @pre config->frequency_hz must be > 0 and <= PCLKB / 8 (7.5 MHz at 60 MHz PCLKB)
 * @pre channel must not be k_cmt_channel_0
 * @pre System clocks must be initialized (PCLKB = 60 MHz)
 *
 * @post Timer running at requested frequency
 * @post config->callback registered and called from ISR at each compare match
 * @post s_cmt_initialized[channel] set to true
 * @post ICU interrupt for the channel enabled at specified priority
 *
 * @note Not thread-safe - call once per channel during system initialization
 * @note Callback executes in interrupt context; keep it short and non-blocking
 * @warning CMT0 is reserved for ThreadX; do not use k_cmt_channel_0
 *
 * @par Thread Safety:
 * Not thread-safe. Call once per channel during initialization before starting
 * the RTOS scheduler or with interrupts disabled.
 *
 * @par Performance:
 * - Execution time: ~5 us (mostly register writes)
 * - Stack usage: 48 bytes
 *
 * @par Example:
 * @code{.c}
 * static void my_timer_cb(void* user_data)
 * {
 *   // Called at 1 kHz from interrupt context
 *   (void)user_data;
 *   toggle_led();
 * }
 *
 * const rx_cmt_config_t cfg = {
 *   .frequency_hz = 1000,         // 1 kHz
 *   .priority     = 5,
 *   .callback     = my_timer_cb,
 *   .user_data    = nullptr,
 * };
 *
 * rx_err_t err = rx_cmt_init(k_cmt_channel_1, &cfg);
 * if (err != k_rx_ok) {
 *   rx_log_error("APP", "CMT init failed");
 * }
 * @endcode
 *
 * @see rx_cmt_deinit() Stop and release channel
 * @see rx_cmt_start() Start a previously stopped channel
 * @see rx_cmt_stop() Stop the timer without deinitializing
 * @see rx_cmt_config_t Configuration structure definition
 *
 * @since Version 1.0.0
 */
rx_err_t rx_cmt_init(const rx_cmt_channel_t channel, const rx_cmt_config_t* config)
{
  /* Validate parameters */
  rx_err_t err = internal_validate_cmt_init_params(channel, config);
  if (err != k_rx_ok) {
    return err;
  }

  volatile rx_cmt_channel_regs_t* cmt = internal_get_cmt_base(channel);
  if (cmt == nullptr) {
    return k_rx_err_invalid_arg;
  }

