Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_cmt.c
  /* Calculate divider and compare value */
  uint8_t  divider;
  uint16_t cmcor;
  err = internal_calculate_cmt_params(config->frequency_hz, &divider, &cmcor);
  if (err != k_rx_ok) {
    return err;
  }

  /* Enable CMT module (clear module stop bit) */
  internal_enable_cmt_module_clock();

  /* Stop timer before configuration */
  err = rx_cmt_stop(channel);
  if (err != k_rx_ok) {
    return err;
  }

  /* Configure timer registers */
  internal_configure_cmt_timer_registers(cmt, divider, cmcor);

  /* Configure interrupt */
  err = internal_configure_cmt_interrupt(
    (rx_cmt_interrupt_config_t){.channel = channel, .priority = config->priority});
  if (err != k_rx_ok) {
    return err;
  }

  /* Save callback and mark initialized */
  internal_save_cmt_callback(channel, config);

  /* Start timer */
  err = rx_cmt_start(channel);
  if (err != k_rx_ok) {
    return err;
  }

  rx_log_info(s_tag, "CMT initialized");

  return k_rx_ok;
}

/**
 * @brief Start CMT counter for a previously initialized channel
 *
 * @details
 * Sets the appropriate bit in the CMSTR0 or CMSTR1 register to start the
 * CMT counter running. After setting the bit the register is read back to
 * verify the hardware accepted the write. Channels 0/1 share CMSTR0;
 * channels 2/3 share CMSTR1. Channels 0 and 1 use STR0/STR1 bits respectively,
 * as do channels 2 and 3.
 *
 * @param[in] channel CMT channel to start
 *   - **Valid range**: k_cmt_channel_0 through k_cmt_channel_3
 *   - **Note**: Usually called internally by rx_cmt_init()
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success; counter is running
 * @retval k_rx_err_invalid_arg Invalid channel number
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_hw_error CMSTR readback did not show bit set
 *
 * @pre channel must be initialized via rx_cmt_init()
 * @pre channel must be in range [0, 3]
 *
 * @post CMSTR bit for channel is set
 * @post Counter begins incrementing from its current value
 *
 * @note Usually called automatically by rx_cmt_init(); call explicitly only after rx_cmt_stop()
 * @note Performs a readback check to verify the hardware write succeeded
 *
 * @par Thread Safety:
 * Not thread-safe; do not call concurrently with stop/deinit on the same channel.
 *
 * @par Example:
 * @code{.c}
 * // Pause then resume timer
 * rx_cmt_stop(k_cmt_channel_1);
 * // ... do critical work ...
 * rx_cmt_start(k_cmt_channel_1);
 * @endcode
 *
 * @see rx_cmt_stop() Stop the counter
 * @see rx_cmt_init() Initialize channel (calls start internally)
 *
 * @since Version 1.0.0
 */
rx_err_t rx_cmt_start(const rx_cmt_channel_t channel)
{
  if ((uint8_t)channel >= k_cmt_max_channels) {
    return k_rx_err_invalid_arg;
  }

  if (!s_cmt_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  /* Set corresponding bit in CMSTR register */
  switch (channel) {
    case k_cmt_channel_0: {
      const uint16_t bit_mask = (uint16_t)(k_cmt_bit_mask_lsb << k_cmt_cmstr_str0);
      cmt_ctrl()->cmstr0 |= bit_mask;
      const uint16_t cmstr_value = cmt_ctrl()->cmstr0;
      if ((cmstr_value & bit_mask) == k_cmt_value_zero) {
        return k_rx_err_hw_error;
      }
      break;
    }
    case k_cmt_channel_1: {
      const uint16_t bit_mask = (uint16_t)(k_cmt_bit_mask_lsb << k_cmt_cmstr_str1);
      cmt_ctrl()->cmstr0 |= bit_mask;
      const uint16_t cmstr_value = cmt_ctrl()->cmstr0;
      if ((cmstr_value & bit_mask) == k_cmt_value_zero) {
        return k_rx_err_hw_error;
      }
      break;
    }
    case k_cmt_channel_2: {
      const uint16_t bit_mask = (uint16_t)(k_cmt_bit_mask_lsb << k_cmt_cmstr_str0);
      cmt_ctrl()->cmstr1 |= bit_mask;
      const uint16_t cmstr_value = cmt_ctrl()->cmstr1;
      if ((cmstr_value & bit_mask) == k_cmt_value_zero) {
        return k_rx_err_hw_error;
      }
      break;
    }
    case k_cmt_channel_3: {
      const uint16_t bit_mask = (uint16_t)(k_cmt_bit_mask_lsb << k_cmt_cmstr_str1);
      cmt_ctrl()->cmstr1 |= bit_mask;
      const uint16_t cmstr_value = cmt_ctrl()->cmstr1;
      if ((cmstr_value & bit_mask) == k_cmt_value_zero) {
        return k_rx_err_hw_error;
      }
      break;
    }
    default:
      return k_rx_err_invalid_arg;
  }

  return k_rx_ok;
}

/**
 * @brief Stop CMT counter without deinitializing the channel
 *
 * @details
 * Clears the appropriate bit in CMSTR0 or CMSTR1 to halt the CMT counter.
 * After clearing the bit the register is read back to verify the hardware
 * accepted the write. The channel remains initialized; call rx_cmt_start()
 * to resume counting.
 *
 * Note that rx_cmt_stop() does NOT require the channel to be initialized
 * (s_cmt_initialized check is omitted intentionally so that rx_cmt_init()
 * can call it safely before marking the channel as initialized).
 *
 * @param[in] channel CMT channel to stop
 *   - **Valid range**: k_cmt_channel_0 through k_cmt_channel_3
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success; counter halted
 * @retval k_rx_err_invalid_arg Invalid channel number
 * @retval k_rx_err_hw_error CMSTR readback showed bit still set
 *
 * @pre channel must be in range [0, 3]
 * @pre Interrupts may still fire if one is already pending when stop is called
 *
 * @post CMSTR bit for channel is cleared
 * @post Counter stops incrementing (current CMCNT value preserved)
 *
 * @note Does not clear the initialized flag - channel can be restarted
 * @note Called by rx_cmt_init() before programming registers (safe on uninitialized channel)
 *
 * @par Thread Safety:
 * Not thread-safe; do not call concurrently with start/init/deinit on the same channel.
 *
 * @par Example:
 * @code{.c}
 * // Temporarily suspend timer
 * rx_cmt_stop(k_cmt_channel_2);
 * reconfigure_something();
 * rx_cmt_start(k_cmt_channel_2);
 * @endcode
 *
 * @see rx_cmt_start() Resume counting
 * @see rx_cmt_deinit() Stop and release channel resources
 *
 * @since Version 1.0.0
 */
rx_err_t rx_cmt_stop(const rx_cmt_channel_t channel)
{
  if ((uint8_t)channel >= k_cmt_max_channels) {
    return k_rx_err_invalid_arg;
  }

  /* Clear corresponding bit in CMSTR register */
  switch (channel) {
    case k_cmt_channel_0: {
      const uint16_t bit_mask = (uint16_t)(k_cmt_bit_mask_lsb << k_cmt_cmstr_str0);
      cmt_ctrl()->cmstr0 &= (uint16_t)~bit_mask;
      const uint16_t cmstr_value = cmt_ctrl()->cmstr0;
      if ((cmstr_value & bit_mask) != k_cmt_value_zero) {
        return k_rx_err_hw_error;
      }
      break;
    }
    case k_cmt_channel_1: {
      const uint16_t bit_mask = (uint16_t)(k_cmt_bit_mask_lsb << k_cmt_cmstr_str1);
      cmt_ctrl()->cmstr0 &= (uint16_t)~bit_mask;
      const uint16_t cmstr_value = cmt_ctrl()->cmstr0;
      if ((cmstr_value & bit_mask) != k_cmt_value_zero) {
        return k_rx_err_hw_error;
      }
      break;
    }
    case k_cmt_channel_2: {
      const uint16_t bit_mask = (uint16_t)(k_cmt_bit_mask_lsb << k_cmt_cmstr_str0);
      cmt_ctrl()->cmstr1 &= (uint16_t)~bit_mask;
      const uint16_t cmstr_value = cmt_ctrl()->cmstr1;
      if ((cmstr_value & bit_mask) != k_cmt_value_zero) {
        return k_rx_err_hw_error;
      }
      break;
    }
    case k_cmt_channel_3: {
      const uint16_t bit_mask = (uint16_t)(k_cmt_bit_mask_lsb << k_cmt_cmstr_str1);
      cmt_ctrl()->cmstr1 &= (uint16_t)~bit_mask;
      const uint16_t cmstr_value = cmt_ctrl()->cmstr1;
      if ((cmstr_value & bit_mask) != k_cmt_value_zero) {
        return k_rx_err_hw_error;
      }
      break;
    }
    default:
      return k_rx_err_invalid_arg;
  }

