Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_cmt.c
  return k_rx_ok;
}

/**
 * @brief Read current CMT counter (CMCNT) value
 *
 * @details
 * Returns the instantaneous value of the 16-bit CMCNT register for the
 * specified channel. The counter increments at PCLKB divided by the
 * configured divider (/8, /32, /128, or /512) and resets to 0 on compare
 * match. Useful for measuring elapsed time within a period.
 *
 * @param[in] channel CMT channel to read (0-3)
 *   - **Valid range**: k_cmt_channel_0 through k_cmt_channel_3
 *
 * @param[out] count Pointer to store the 16-bit counter value
 *   - **Valid range**: Non-nullptr to uint16_t
 *   - **On success**: Contains CMCNT value (0 to CMCOR)
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success; *count contains current CMCNT value
 * @retval k_rx_err_null_ptr count is nullptr
 * @retval k_rx_err_invalid_state Channel not initialized or invalid channel
 * @retval k_rx_err_invalid_arg Could not obtain register base pointer
 *
 * @pre Channel must be initialized via rx_cmt_init()
 * @pre count must point to valid uint16_t storage
 *
 * @post *count set to CMCNT register value at time of read
 * @post Counter continues running (read is non-destructive)
 *
 * @note Value may change between consecutive reads if counter is running
 * @note For precise time measurements disable interrupts around consecutive reads
 *
 * @par Thread Safety:
 * Read-only; safe to call from multiple contexts, but value may be stale.
 *
 * @par Example:
 * @code{.c}
 * uint16_t ticks = 0;
 * rx_err_t err   = rx_cmt_get_count(k_cmt_channel_1, &ticks);
 * if (err == k_rx_ok) {
 *   // ticks = current counter position within the period
 * }
 * @endcode
 *
 * @see rx_cmt_init() Initialize channel and set frequency
 * @see rx_cmt_start() Start the counter
 *
 * @since Version 1.0.0
 */
rx_err_t rx_cmt_get_count(const rx_cmt_channel_t channel, uint16_t* count)
{
  const volatile rx_cmt_channel_regs_t* cmt = nullptr;

  RX_CHECK_NULL_PTR(count, s_tag, "count pointer is nullptr");

  if ((uint8_t)channel >= k_cmt_max_channels || !s_cmt_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  cmt = internal_get_cmt_base(channel);
  if (cmt == nullptr) {
    return k_rx_err_invalid_arg;
  }

  *count = cmt->cmcnt;
  return k_rx_ok;
}

/**
 * @brief Deinitialize CMT channel and release all resources
 *
 * @details
 * Stops the CMT counter, disables the ICU interrupt for the channel,
 * clears the stored callback and user data, and marks the channel as
 * uninitialized. After this call the channel may be re-initialized with
 * rx_cmt_init().
 *
 * **Algorithm steps:**
 * 1. Validate channel range
 * 2. Stop timer via rx_cmt_stop() and propagate any error
 * 3. Compute ICU vector, IER index, and IER bit for the channel
 * 4. Clear the IER bit to disable the interrupt
 * 5. Clear callback, user_data, and initialized flag
 *
 * @param[in] channel CMT channel to deinitialize (0-3)
 *   - **Valid range**: k_cmt_channel_0 through k_cmt_channel_3
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success; channel fully deinitialized
 * @retval k_rx_err_invalid_arg Invalid channel number
 * @retval k_rx_err_hw_error Timer stop verification failed
 *
 * @pre channel must be in range [0, 3]
 * @pre Caller should ensure no other task is using the channel callback
 *
 * @post Counter halted (CMSTR bit cleared)
 * @post ICU interrupt disabled for channel
 * @post s_cmt_initialized[channel] set to false
 * @post s_cmt_callback[channel] and s_cmt_user_data[channel] set to nullptr
 *
 * @note Safe to call on an uninitialized channel (rx_cmt_stop tolerates it)
 * @note Module clock is NOT re-asserted - hardware remains clocked for re-use
 *
 * @par Thread Safety:
 * Not thread-safe. Ensure no ISR or other thread is using the channel.
 *
 * @par Example:
 * @code{.c}
 * rx_err_t err = rx_cmt_deinit(k_cmt_channel_1);
 * if (err != k_rx_ok) {
 *   rx_log_error("APP", "CMT deinit failed");
 * }
 * @endcode
 *
 * @see rx_cmt_init() Re-initialize after deinit
 * @see rx_cmt_stop() Stop without full deinit
 *
 * @since Version 1.0.0
 */
rx_err_t rx_cmt_deinit(const rx_cmt_channel_t channel)
{
  if ((uint8_t)channel >= k_cmt_max_channels) {
    return k_rx_err_invalid_arg;
  }

  /* Stop timer and propagate any errors */
  rx_err_t err = rx_cmt_stop(channel);
  if (err != k_rx_ok) {
    return err;
  }

  /* Disable interrupt */
  const uint8_t vector    = k_vect_cmt0_cmi0 + channel;
  const uint8_t ier_index = vector / k_icu_ier_bits_per_reg;
  const uint8_t ier_bit   = vector % k_icu_ier_bits_per_reg;
  const uint8_t ier_mask  = (uint8_t)(k_cmt_bit_mask_lsb << ier_bit);
  icu()->ier[ier_index] &= (uint8_t)~ier_mask;

  /* Clear callback */
  s_cmt_callback[channel]    = nullptr;
  s_cmt_user_data[channel]   = nullptr;
  s_cmt_initialized[channel] = false;

  rx_log_info(s_tag, "CMT deinitialized");

  return k_rx_ok;
}
